app/views/orders/new.html.erb

            <!-- Classic products -->
            <% @cart.line_items.each do |item| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 48]]