app/views/orders/show.html.erb

          <li><span class="address_Customer:name"><%= @order.address.name %></span></li>
          <li><span class="address_Country:name"><%= @order.address.country %></span></li>
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT 1  [["id", 1]]

      <!-- Classic products -->
      <% @order.line_items.each do |item| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 1]]