app/views/carts/show.html.erb

SELECT  "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1 AND "line_items"."product_id" = $2 LIMIT 1  [["cart_id", 1], ["product_id", 5]]
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 1]]
---
			<span class="heading-counter"><%= t('.items_in_cart') %>:
			<span id="summary_products_quantity"><%= @cart.line_items.count%></span>