app/controllers/addresses_controller.rb

  def create

    @address = Address.new(address_params.merge(:user_id => current_user.id))
    respond_to do |format|
      if @address.save
---
INSERT INTO "addresses" ("name", "address", "phone", "country", "city", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def set_address
    @user_address = Address.find(params[:id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT 1  [["id", 6]]