app/controllers/carts_controller.rb

  def index
    @carts = Cart.all
    @categories = Category.all
---
SELECT "carts".* FROM "carts"
SELECT "categories".* FROM "categories"

  def show
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def destroy
    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 1]]