app/controllers/category_controller.rb

  def index
    @categories = Category.all
    @products =  Product.order(:title).page(params[:page]).per(15)
---
SELECT "categories".* FROM "categories"
SELECT  "products".* FROM "products"  ORDER BY "products"."title" ASC LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "products"

  def show
    @categories = Category.all
    @category = Category.find(params[:id])
    @products = @category.products.order(:title).page(params[:page]).per(3)
---
SELECT "categories".* FROM "categories"
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = $1  [["category_id", 2]]