app/controllers/category_controller.rb

  def show

    @category = Category.find(params[:id])
    @products = @category.products.order(:title).page(params[:page]).per(6)
---
SELECT  "products".* FROM "products" WHERE "products"."category_id" = $1  ORDER BY "products"."title" ASC LIMIT 6 OFFSET 0  [["category_id", 2]]