app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 5]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-08-23 13:04:25.307303"], ["updated_at", "2015-08-23 13:04:25.307303"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 5], ["cart_id", 1], ["created_at", "2015-08-23 13:04:25.462227"], ["updated_at", "2015-08-23 13:04:25.462227"]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 2], ["updated_at", "2015-08-28 19:10:51.874193"], ["id", 69]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save