app/controllers/orders_controller.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 48]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-08-29 02:22:54.640385"], ["updated_at", "2015-08-29 02:22:54.640385"]]
INSERT INTO "orders" ("address_id", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address_id", 1], ["price", 14700.0], ["user_id", 5], ["created_at", "2015-08-28 22:41:02.792090"], ["updated_at", "2015-08-28 22:41:02.792090"]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 49]]
---
  def create



    @order = Order.new(order_params.merge(:price => @cart.total_summ, :user_id => current_user.id,))
    @order.add_line_items_from_cart(@cart)
    @order.order_status_id = 1


    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 5]]
---
  def order_history

    @order_history = Order.where(:user_id => current_user.id)